#下标访问列表
L= [3,2,1,4,6,3,2]
print(L[3])

print(L[0])
#分片操作
#注意截取范围，包含左不包含右

print(L[1:4])

#下标值可以为空，如果左边不写，默认为0，右边为最大数加1即最后一个数
print (L[:])
print (L[:4])
print (L[2:])

#分片可以控制增长幅度，默认增长幅度为1
print(L[1:6:1])

#打印从下标1开始的数字，每次隔一个
print(L[1:6:2])

#下标可以超出范围，超出后不再考虑多余下标内容
print(L[2:10])

#增长幅为负数，表示从右往左打印,从-1开始
print(L[-2:-4])

#分片左边的值一定小于右边的数，否则为空（如上结果），修改为：
print(L[-4:-2])

#如果分片一定左边值大于右边，则步长餐胡需要使用负数，但截取顺序和原来的列表顺序不同
#此案例为一个list直接正反颠倒提供了一种思路（还未思考）
print(L[-2:-4:-1])


